Tekla Open API Reference for Tekla Structures 2025
AttributesBase.LoadAttributes Method
 Loads the attributes from the specified file.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract bool LoadAttributes(
	string AttributeFile
)
Public MustOverride Function LoadAttributes (
	AttributeFile As String
) As Boolean
Parameters
AttributeFile
Type: System.String
The filename of the attribute file. Use only the filename, not the extension.
Return Value
Type: Boolean
True if the attributes are loaded correctly. False if the attribute file loading failed.
See Also
Reference
AttributesBase Class
Tekla.Structures.Drawing Namespace